fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресИзХранилища = "";
	
	// Метод "Свойство" ищет ключ в структуре параметров, 
	// даже если он не описан в метаданных формы.
	Если Параметры.Свойство("АдресВХранилище", АдресИзХранилища) Тогда
		
		Если ЗначениеЗаполнено(АдресИзХранилища) Тогда
			ТЗ_Данные = ПолучитьИзВременногоХранилища(АдресИзХранилища);
			
			Если ТипЗнч(ТЗ_Данные) = Тип("ТаблицаЗначений") Тогда
				ОбновитьДиаграммуГанта(ТЗ_Данные);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДиаграммуГанта(ТЗ_Данные)
	
	// Очищаем диаграмму перед заполнением
	Диаграмма.Очистить();
	
	Диаграмма.АвтоОпределениеПолногоИнтервала = Истина;
	
	
	// 2. Настраиваем структуру: Точки (Сотрудники) и Серии (Отпуска)
	// В диаграмме Ганта обычно одна серия, а периоды добавляются как интервалы
	СерияОтпуск = Диаграмма.Серии.Добавить();
	СерияОтпуск.Текст = "Отпуска";
	СерияОтпуск.Цвет = WebЦвета.Аквамарин;
	
	Для Каждого СтрокаДанных Из ТЗ_Данные Цикл
		
		// Создаем или находим точку (Сотрудника)
		ТочкаСотрудник = Диаграмма.УстановитьТочку(СтрокаДанных.Сотрудник);
		ТочкаСотрудник.Текст = Строка(СтрокаДанных.Сотрудник); 
		
		// Создаем интервал (полоску на графике)
		Значение = Диаграмма.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
		Интервал = Значение.Добавить();
		
		Интервал.Текст = Строка(СтрокаДанных.Сотрудник);
		Интервал.Начало = СтрокаДанных.ДатаНачала;
		Интервал.Конец  = СтрокаДанных.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
